Output from `terraform plan`
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.glue_job_shared_custom_log4j_properties will be updated in-place
  ~ resource "aws_s3_object" "glue_job_shared_custom_log4j_properties" {
      ~ etag                   = "a038ba6a171e6e655edd5a15142e0d1e" -> "a16f83edfb0b801002a664e77e242b9a"
        id                     = "logging/ingestion-jobs/log4j2.properties"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.maintenance-pipeline-triggers["dps-activities"].aws_scheduler_schedule.schedule[0] will be created
  + resource "aws_scheduler_schedule" "schedule" {
      + arn                          = (known after apply)
      + description                  = "Triggers the Maintenance Pipeline Based on a Given Schedule"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dpr-maintenance-pipeline-dps-dps-activities-preproduction"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 1 ? * * *)"
      + schedule_expression_timezone = "Europe/London"
      + state                        = "ENABLED"

      + flexible_time_window {
          + maximum_window_in_minutes = 30
          + mode                      = "FLEXIBLE"
        }

      + target {
          + arn      = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-maintenance-pipeline-dps-dps-activities-preproduction"
          + input    = jsonencode(
                {
                  + Input           = ""
                  + StateMachineArn = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-maintenance-pipeline-dps-dps-activities-preproduction"
                }
            )
          + role_arn = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
        }
    }

  # module.maintenance-pipeline["dps-activities"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Maintenance Pipeline Step Function"
              + StartAt = "Stop DMS Replication Task"
              + States  = {
                  + "Check All Pending Files Have Been Processed" = {
                      + Next       = "Stop Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          + JobName   = "unprocessed-files-check-dps-activities-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Resume DMS Replication Task"                 = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:VV3GU4RU4QMK5FSTWABLLO35BP4BBM7KWV4UULY"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Curated Zone"          = {
                      + Next       = "Run Vacuum Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "dps-activities"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Compaction Job on Structured Zone"       = {
                      + Next       = "Run Vacuum Job on Structured Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "dps-activities"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          + JobName         = "dpr-maintenance-compaction-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Curated Zone"              = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "dps-activities"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Run Vacuum Job on Structured Zone"           = {
                      + Next       = "Run Compaction Job on Curated Zone"
                      + Parameters = {
                          + Arguments       = {
                              + "--dpr.config.key"            = "dps-activities"
                              + "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              + "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          + JobName         = "dpr-maintenance-retention-preproduction"
                          + NumberOfWorkers = 2
                          + WorkerType      = "G.1X"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                    = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "dps-activities"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop DMS Replication Task"                   = {
                      + Next       = "Check All Pending Files Have Been Processed"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.dms.replication.task.id" = "dpr-dms-dps-postgres-s3-dps-activities-task-preproduction"
                            }
                          + JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                     = {
                      + Next       = "Run Compaction Job on Structured Zone"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-dps-dps-activities-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-activities"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-activities"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```